ai-cgs/baby.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-02 Thu 19:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Baby AGI and Developmental Cognitive Science</title>
<meta name="author" content="shubhamkar" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, shrink-to-fit=no">
<link rel="stylesheet" type="text/css" href="../others.css">

<link rel='stylesheet' href='styles.css'>
<link rel='stylesheet' type='text/css' href='https://fonts.googleapis.com/css?family=Droid+Sans' />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Baby AGI and Developmental Cognitive Science</h1>
<div class="org-center">
<p>
<b>Up:</b> <a href="../thoughts.html">AI and CogSci</a> | <b>Previous:</b> None | <b>Next:</b> <a href="nar.html">Non-Axiomatic Reasoning</a>
</p>
</div>

<p>
We are no more than a lump of carbon, hydrogen, oxygen and several other
elements on this giant planet we call Earth. The universe will run out of stars some day. Sooner than that, the sun will run out of hydrogen. Perhaps sooner, another large piece of rock strikes Earth again, causing yet another mass extinction. Or, may be, a near-earth supernova fries the Earth.
</p>

<p>
You get it. We &#x2013; humans &#x2013; are not safe. It isn't wise to keep all our
eggs in one basket. We need to colonize beyond Earth. Yes, space exploration and habitation research is important. But I wish to point towards another research direction. As marvellous as our biological bodies are, they are
ill-suited for living beyond Earth, especially during interplanetary travel. Shown again was the vulnerability of our biological bodies when we struggled against the Covid19 pandemic. A better substrate to replace our biological bodies would be excellent.
</p>

<p>
But while artificial limbs are important elements for overcoming our biology bodies, I want to bring the reader's <del>focus</del> mind to their&#x2026; mind. I'm interested in the creation of an artificial mind.
</p>

<p>
A separate motivation for this also stems from mere curiosity. Sitting
behind those darting eyes lies one of the most mysterious systems in
the universe &#x2013; 100 billion neurons, each connected to almost 10
thousand others &#x2013; all made of the same carbon we obtain when we burn
sugar on a stove. How can something as nonliving as a piece of rock be
made of the same basic elements that make up something as lively as you or me? Perhaps, along with the mysteries of the cosmos, mysteries of our minds will continue to be amongst the longest unsolved puzzles of humankind.
</p>

<p>
Of course, <i>once</i> Artificial General Intelligence is attained,
speculation has it that it will soon explode into a singularity, for
better or worse. Hopefully, it proves helpful in finding solutions to
cancer, physics, inequity, and sustainable progress, amongst other
things. (Or, maybe, the Covid19 pandemic taught us some form of equity
already?)
</p>

<p>
But where does one begin taking a crack at AGI? Maybe one way is to look
inward at the only example we have of sufficiently general intelligence
&#x2013; ourselves. But clearly, no direct intervention puts our minds into
their adult forms. Plus, studying the adult mind is like studying the
artifacts left behind by the sociocultural environment the individual
grew up in. Doesn't seem like a great way to understand where nature
ended and nurture began.
</p>

<p>
At the <a href="http://agi-conf.org/2021/">AGI 2021</a> conference, I was pleasantly surprised to be affirmed by this primitive conclusion. Bootstrapping was an important theme throughout the conference: <i>We should not aim to create Artificial General Intelligence. We should aim at creating a (minimal) system that could give rise to Artificial General Intelligence.</i> One may argue that this itself is sufficiently general intelligence.
</p>

<p>
Clearly, such a system already exists: the human child. If the reader is
a younger me, pondering over what intelligence is, how our brain-minds
do what they do, then know that Childhood Cognitive Development and Bootstrapping could be a valuable perspective to consider. I was pleased to hear that Michael Tomasello, one of the leading figures in First Language Acquisition, also pointed towards studying Phylogeny and Ontogeny to understand human cognition better in his <a href="https://www.youtube.com/watch?v=pPFSQQ0MUHo">Rumelhart Prize Presentation at the CogSci 2022 Conference</a>.
</p>

<div id="outline-container-orga421090" class="outline-2">
<h2 id="orga421090">Learning Resources</h2>
<div class="outline-text-2" id="text-orga421090">
<p>
Following are some resources that may be useful for starting out with Artificial General Intelligence.
</p>

<p>
The AGI Conferences are listed <a href="https://agi-conf.org/">here</a>, with AGI 2021 available <a href="http://agi-conference.org/2021">here</a> and its schedule <a href="https://agi-conf.org/2021/schedule/">here</a>. The proceedings are also available for <a href="https://link.springer.com/book/10.1007/978-3-030-93758-4">reading</a> and <a href="https://www.youtube.com/playlist?list=PLAJnaovHtaFTzIS4eBi9Jm5eMlsRzFoEA">viewing</a>! Many excellent resources for self-education in AGI and prerequisites have been collected <a href="https://cis.temple.edu/~pwang/AGI-Curriculum.html">here</a>. In terms of keywords, "bootstrapping agi" might yield more relevant results than "bootstrapping" alone.
</p>

<p>
When it comes to childhood cognition, <a href="https://onlinelibrary.wiley.com/doi/book/10.1002/9781444325485">Wiley-Blackwell's Handbook of Childhood Cognitive Development</a> can be a good place to start. However, while there have been calls for <a href="https://en.wikipedia.org/wiki/Unified_Theories_of_Cognition">Unified Theories of Cognition</a> since the 1990s, I am yet to come across a call for a <i>Unified Theory of Developmental Cognition</i>. There has been significant progress in mainstream AI over the last 30 years which can be used for such a unified theory. Still, certain important elements remain: particular ones, I am interested in include (i) discovering causal models from high dimensional data (ii) augmenting machine learning via shared attention and theory of mind.
</p>

<p>
All is not well in the field of AGI either. In particular, as <a href="https://www.sciencedirect.com/science/article/pii/S1877050922002228">this paper</a> points out, most AGI research leans towards being Proof of Concept rather than digging deeper. Good AGI research is relatively rare. Pei Wang's <a href="https://cis.temple.edu/~pwang/NARS-Intro.html">Non-Axiomatic Reasoning System</a> is an research direction I have found promising.
</p>

<p>
<a href="https://cis.temple.edu/~pwang/AGI-Curriculum.html">Pei Wang</a> has put together an excellent AGI curriculum. Here is an alternative suggestion based on my experiences so far:
</p>

<ul class="org-ul">
<li>School Education (expected 2 dedicated years):
<ul class="org-ul">
<li>Prerequisites: English, understanding of a 10/14 year old</li>
</ul></li>
<li>Computer Science (expected 2 dedicated years): <a href="https://teachyourselfcs.com/">teachyourselfcs.com</a>
<ul class="org-ul">
<li>Prerequisites: English, Mathematics from the above resource, understanding of a 16/18 year old</li>
</ul></li>
</ul>

<p>
Something more directly relevant to the discussions above includes:
</p>

<ul class="org-ul">
<li>Dedicated 2 months: <a href="https://link.springer.com/book/9780387310732">Christopher Bishop's Pattern Recognition and Machine Learning</a></li>
<li>Dedicated 1 month: <a href="https://www.goodreads.com/book/show/6296680-understanding-psychology-as-a-science">Diene's Understanding Psychology as a Science</a></li>
<li>Dedicated 2 months: <a href="https://www.cambridge.org/core/journals/philosophy-of-science/article/abs/zenon-w-pylyshyn-computation-and-cognition-toward-a-foundation-for-cognitive-science-cambridge-ma-bradford-booksmit-press-1984-xxiii-292-pp-2500/830D21F75AC20AE4E5CA419E91A77C9D">Pylyshyn's Computation and Cognition: Toward a Foundation for Cognitive Science</a></li>
<li>Dedicated 1 month: <a href="http://ruccs.rutgers.edu/images/personal-zenon-pylyshyn/nicodbook/Cognet_PDF/Pylyshyn_Things_all.pdf">Pylyshyn's Things and Places: How the Mind Connects with the World</a></li>
<li>Dedicated 2 months: <a href="https://www.worldscientific.com/worldscibooks/10.1142/8665">Pei Wang's Non-Axiomatic Logic: A Model of Intelligent Reasoning</a></li>
</ul>

<p>
Other readings:
</p>
<ul class="org-ul">
<li><i>all</i> of Pylyshyn's writings</li>
<li><i>all</i> of Pei Wang's writings</li>
<li><i>all</i> of Judea Pearl's writings</li>
</ul>

<p>
*When I say "dedicated", it assumes you will be working full-time on the topic.
</p>

<div class="org-center">
<p>
<b>Up:</b> <a href="../thoughts.html">AI and CogSci</a> | <b>Previous:</b> None | <b>Next:</b> <a href="nar.html">Non-Axiomatic Reasoning</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
